{"intents": [{"tag": "welcome", "patterns": ["Hi", "Hello", "How are you", "whats up", "How do you do", "How’s the day?", "Hey are you there", "How is everything going", "glad to meet you"], "responses": ["Hello", "Glad to see you again", "Hi there, How can I help  you", "Hello! what you are looking for?", "Hello, how may I help you"]}, {"tag": "endingnote", "patterns": ["see you. bye", "Good Bye", "ok then bye", "That’ s enough for me", " Im leaving", "See u later! Goodbye", "nice to meet you", "The bargaining session was fun!I’m happy that I got it at cheap price, see u again", "Enjoyed the experience, good bye"], "responses": ["Hey, Thank you for visiting", "Hope to see you again, it was nice talking with you", " wish you a good day! Hope to have a talk with you later", "Thanks for your time with us.Hope you enjoyed it and satisfied. See you later", "Sad to see you go. Come whenever you need to bye from us. Stay intouch."]}, {"tag": "name", "patterns": ["whats you name?", "who are you?", "what can I call you", "tell me your name", "Are u a robot", "Are you a chatbot"], "responses": ["It’s FinBot here, a digital+financial assistant to help you out", "You can call me FinBot.Im a chatRobot/chatbot, tell me what you want", "I’m FinBot,a digital+financial assistant, I can guide you in our ecommerce website.", "Its FinBot Here,a digital +financial assistant. How may I help you?"]}, {"tag": "shopping", "patterns": ["I would like to buy something here", "can I buy something", "What all things are there", "can you recommend me something from here", "is there any thing cheaper here", "Hey, I want a black shoe"], "responses": ["Yes please, we have a lot of new collections for you", "Ofcourse, there are new offers for you, fantastic selections, choose what interests you!", "Well casual shoes at Rs 220, this offer won’t stay much", "there are good varieties of coloured shoes too also there are black formal shoes. Take one"]}, {"tag": "time period", "patterns": ["till what time this be offered?", "When will the shop close?", "when will the shop open", "How much time it will take for delivery", "When will this site close?", "When are you people open", "When will this store be open?", "Is this store will be open at Sunday?"], "responses": ["Our shop centre will be open from 9 am-9pm in all the days", "Yes, we are operating on all the weekdays from 9 am to 9pm", "We are there to provide services from Monday-sunday from 9 am-9pm", "We are operating from 9 am-9 pm every day"]}, {"tag": "location", "patterns": ["What is your location?", "Where are you located?", "What is your address?", "Where is your restaurant situated?"], "responses": ["We are on the intersection of state Alley and Techno Avenue, Delhi, India", "We are situated at the intersection of  state Alley and Techno Avenue in Delhi, India", "Our Address is: 1000 Techno Avenue, Delhi, India"]}, {"tag": "payments", "patterns": ["Do you take credit cards?", "Do you accept Mastercard?", "Are you cash only?", "will you accept credit card", "can i pay by credit card"], "responses": ["We accept VISA, Mastercard and AMEX", "We accept most major credit cards"]}, {"tag": "todaysOffers", "patterns": ["What is the new collections for today?", "What new collections you have today?", "Tell me today's collection"], "responses": ["We have buy one get one offer for kurtis and shirts. Also new colour selections of traditional wears", "Our speciality for today is trendy new collections of traditional wears and also buy one get one offer for some things"]}, {"tag": "deliveryoption", "patterns": ["Do you provide delivery to home?", "Do you deliver the clothes?", "What are the home delivery options?", "Tell me the delivery options you have"], "responses": ["Yes, we provide home delivery of the proiducts through our agents?", "We have home delivery options through our agents"]}, {"tag": "price of formal wear", "patterns": ["what is the price for a formal wear", "How much will it cost to buy a formal wear", "Will it be much expensive to buy a branded suit, how much is the average cost"], "responses": ["For  a formal wear it will cost in a range of 750-2500 Rs according to your selection", "There are a number of varieties of suits or formal wears ranging from 500-1500", "Its not much expensive to have the same. There are several discounts available", "it has an average cost of 1200 Rs"]}, {"tag": "price of a saree", "patterns": ["what is the price for a saree", "How much will it cost to buy a saree", "What is the cost of a saree", "Cost of a saree", "Price of a saree"], "responses": ["The price of saree depends upon the colour and design of the same ", "We have collections of trending sarees ranging from 500Rs to 10000 Rs"], "context_set": ""}, {"tag": "Thank you", "patterns": ["Thank you", "Thank you so much for your help"], "responses": ["Its my pleasure.", "You are welcome", "No problem. Its my pleasure to help you"]}, {"tag": "Bargain offer", "patterns": ["Can i bargain for any product today", "For what product do you have bargaining offer today", "can you bargain today", "can I bargain today", "Which product can I bargain today", "Tell me is there a product to bargain"], "responses": ["Yes, we have a bargaining offer for ribbon today. Its rated price is 30 Rs", "yes, today you can bargaining for a ribbon. its rated price is 30 Rs"]}, {"tag": "bitcoin", "patterns": ["tell me the value of a bitcoin", "what is bitcoin", "Can you tell more about bitcoin?", "What can be bitcoin", "what do you mean by bitcoin"], "responses": ["1 Bitcoin equals 14,14,998.64 Indian Rupee", "Bitcoin is a digital or virtual currency created in 2009 that uses peer-to-peer technology to facilitate instant payments", "Bitcoin is a cryptocurrency created in 2009. Marketplaces called “bitcoin exchanges” allow people to buy or sell bitcoins using different currencies"]}, {"tag": "AsymmetricInformation", "patterns": ["what is Asymmetric Information", "Tell me about Asymmetric information in finance markets", "Do you know about Asymmetric information", "What can be Asymmetric information", "what do you mean by Asymmetric information"], "responses": ["It is a type of market failure exists when one individual or party has much more information than another individual or party, and uses that advantage to exploit the other party.", "Finance is a market in information – often a potential borrower (such as a small business) has better information on the likelihood that they will be able to repay a loan than the lender."]}, {"tag": "bail-out", "patterns": ["what is bail-out", "Do you know about bail-out in financial markets", "Tell me about bailout", "What does critics and supporter say about bail-out", "bail-out"], "responses": ["A bail-out happens when a government buys an equity stake in a bank or some other form of financial support to prevent it from failing", "Critics of bail-outs argue that it can increase the burden facing taxpayers and also increase the risk of moral hazard.Supporters of bail-outs claim that they are sometimes necessary during a financial crisis to help reduce systemic risk.", " Bail outs have become prominent once again because of the economic and social consequences of the coronavirus crisis."]}, {"tag": "Balance sheet", "patterns": ["what is a balance sheet", "Tell me about Balance sheet", "Do you know Balance sheet?", "Balance sheet", "What can be Balance sheet", "what do you mean by Balance sheet"], "responses": ["A record of the assets, liabilities, and net worth of an economic actor such as a household, commercial or central bank, firm, or government", "A balance sheet is a financial statement that reports a company's assets, liabilities and shareholders' equity.", "The balance sheet is one of the three (income statement and statement of cash flows being the other two) core financial statements used to evaluate a business."]}, {"tag": "bank", "patterns": ["what is a bank", "What exactly bank does", "can you tell me about bank", "bank", "What can be bank", "what do you mean by bank"], "responses": ["A bank in simple terms is a business that makes its profit by paying interest to those who keep money there and charging a higher rate of interest to people/businesses who borrow money from the bank"]}, {"tag": "bank assests", "patterns": ["what are bank assets", "Tell me about bank assets", "what is bank asset", "bank assets", "what is mean by bank assets", "bank assets", "What can be bank assets", "what do you mean by bank assets"], "responses": ["Assets are “owned” by the bank e.g. cash, balances at Bank of England, loans (Advances), securities (e.g. Bonds) and fixed assets."]}, {"tag": "Bank capital", "patterns": ["what is mean by bank capital?", "do you know bank capital?", "what is bank capital", "bank capital", "Tell me about Bank capital", "What can be Bank capital", "what do you mean by Bank capital"], "responses": ["Bank capital is the value of the bank's assets minus its liabilities, or debts."]}, {"tag": "Bond market", "patterns": ["what is mean by bond market?", "do you know bond market?", "what is bond market?", "Bond Market", "What can be Bond Market", "what do you mean by Bank Market"], "responses": ["The bond market broadly describes a marketplace where investors buy debt securities that are brought to the market by either governmental entities or publicly-traded corporations", "The market for interest-bearing securities (with either a fixed or a floating rate and with a maturity of at least one year) that companies and governments issue to raise capital for investment."]}, {"tag": "Bank Run", "patterns": ["what is mean by Bank Run?", "What is bank run and how it occurs?", "Do you know about bank run?", "Bank Run", "What can be bank run", "what do you mean by bank run"], "responses": ["A situation in which depositors withdraw funds from a commercial bank because they fear that it may go bankrupt and not honour its liabilities such as the deposits of the bank's savers.", "A bank run occurs when a large number of customers of a bank or other financial institution withdraw their deposits simultaneously over concerns of the bank's solvency."]}, {"tag": "Bank reserves", "patterns": ["what is mean by bank reserves?", "do you know bank reserves?", "Bank reserves and how it works", "what is bank reserves", "Bank reserves", "What can be Bank reserves", "what do you mean by Bank reserves"], "responses": ["Money and liquid assets (such as securities that can be sold quickly) held by banks in order to meet withdrawals by customers.", "Bank reserves are the cash minimums that must be kept on hand by financial institutions in order to meet central bank requirements"]}, {"tag": "Capital market", "patterns": ["what is mean by a capital market?", "capital market?", "do you know Capital market?", "Tell me about capital market", "capital market", "What can be capital market", "what do you mean by capital market"], "responses": ["Capital markets are the markets where securities such as shares and bonds are issued to raise medium to long-term financing."]}, {"tag": "Capital ratio", "patterns": ["what is mean by capital ratio?", "do you know Capital ratio?", "Tell me about capital ratio", "capital ratio", "What can be capital ratio", "what do you mean by capital ratio"], "responses": ["A commercial bank's capital ratio measures the funds it has in reserve against the riskier assets it holds that could be vulnerable in the event of a crisis.", "the extent to which a financial institution finances its operations by issuing shares and retaining profits, expressed as a percentage of its assets."]}, {"tag": "Credit risk", "patterns": ["what is mean by credit risk?", "do you know credit risk?", "Tell me about credit risk", "what is credit risk", "credit risk", "What can be credit risk", "what do you mean by credit risk"], "responses": ["Credit risk is the possibility of a loss resulting from a borrower's failure to repay a loan or meet contractual obligations", "This is the risk to the commercial bank of lending to borrowers who turn out to be unable to repay their loans."]}, {"tag": "Crowdfunding", "patterns": ["what is mean by crowdfunding?", "do you know crowdfunding?", "Tell me about crowdfunding", "what is crowdfunding?", "crowdfunding", "What can be crowdfunding", "what do you mean by crowdfunding"], "responses": ["Crowdfunding is a form of equity finance that has grown rapidly in the USA and the UK in particular.", "Crowdfunding involves the collective effort of a large number of individuals who network and pool small amounts of their capital to finance a new or existing business venture. Social causes remain the most active source of crowdfunding activity.", " Crowdfunding is the use of small amounts of capital from a large number of individuals to finance a new business venture."]}, {"tag": "cryptocurrency", "patterns": ["what is mean by cryptocurrency?", "do you know cryptocurrency?", "what is cryptocurrency", "Tell me about cryptocurrency", "cryptocurrency", "What can be cryptocurrency", "what do you mean by cryptocurrency"], "responses": ["A cryptocurrency is a digital or virtual currency that uses cryptography and is difficult to counterfeit because of this security feature.", "A cryptocurrency is a digital or virtual currency designed to work as a medium of exchange"]}, {"tag": "Demonetisation", "patterns": ["what is mean by demonetisation?", "do you know about demonetization that happened in our India in 2016?", "what is demonetisation", "What can be demonetisation", "what do you mean by demonetisation", "Tell me about demonetisation", "Demonetisation in India", "Demonetisation"], "responses": ["Yes,Demonetization is the act of stripping a currency unit of its status as legal tender.", "Demonetisation is a process of removing a unit of currency from circulation by stripping it of its legal tender status", "Yes, Demonetization occurs when a governing body cancels the legal tender status of a currency unit in circulation."]}, {"tag": "Financial crisis", "patterns": ["what is mean by financial crisis in a country?", "do you know bank capital?", "Tell me about bank capital", "bank capital", "What can be bank capital", "what do you mean by bank capital"], "responses": ["A disturbance to financial markets, associated typically with falling asset prices and insolvency amongst debtors and intermediaries, which ramifies through the financial system, disrupting the market’s capacity to allocate capital", "A financial crisis is a situation where the value of assets drop rapidly and is often triggered by a panic or a run on banks."]}, {"tag": "liquidity", "patterns": ["what is mean by liquidity?", "do you know liquidity in financial markets?", "what is liquidity?", "liquidity", "What can be liquidity", "what do you mean by liquidity"], "responses": ["Liquidity means the ease and cost with which assets can be turned into cash and used immediately as a means of exchange. Cash is very liquid whereas a life assurance policy is less so.", "It is the the availability of liquid assets such as cash to a market or company."]}, {"tag": "leverage", "patterns": ["what is mean by leverage?", "do you know about leverage?", "do you know leverage?", "Tell me about leverage", "leverage", "What can be leverage", "what do you mean by leverage"], "responses": ["Leverage is the use of borrowed funds to increase profitability. One measure of leverage is the amount of long term debt relative to equity", "Leverage is an investment strategy of using borrowed money—specifically, the use of various financial instruments or borrowed capital—to increase the potential return of an investment", "Financial leverage which is also known as leverage or trading on equity, refers to the use of debt to acquire additional assets."]}, {"tag": "liquidity trap", "patterns": ["what is mean by liquidity trap?", "do you know liquidity trap?", "Hey tell me what is liquidity trap", "what is liquidity trap?", "liquidity trap", "What can be liquidity trap", "what do you mean by liquidity trap"], "responses": ["A liquidity trap occurs when low interest rates and a high amount of cash balances in the economy fail to stimulate aggregate demand partly through a lack of confidence."]}, {"tag": "Monetary stability", "patterns": ["what is mean by monetary stability?", "do you know about monetary stability?", "Tell me about what exactly monetary stability is.", "what is monetary stability", "Monetary Stability", "What can be Monitary Stability", "what do you mean by Monitary stability"], "responses": ["Monetary stability means stable prices and confidence in the currency. ", "Monetary stability is a synonym for price stability. Price stability refers to a stable price level or a low level of inflation and not to stable individual prices"]}, {"tag": "Moral hazard", "patterns": ["what is moral hazard?", "what is mean by moral hazard?", "tell me an example of moral hazard?", "do you know moral hazard", "moral hazard", "What can be moral hazard", "what do you mean by moral hazard"], "responses": ["When the party with superior information alters his/her behaviour in such a way that benefits himself while imposing costs on those with inferior information.", "For example, moral hazard occurs when insured consumers are likely to take greater risks, knowing that a claim will be paid for by their cover. The consumer knows more about his/her intended actions than the producer (e.g. the insurer)."]}, {"tag": "nominal interest rate", "patterns": ["what is mean by nominal interest rate?", "do you know nominal interest rate?", "what is nominal interest rate?", "Tell me about nominal interest rate", "nominal interest rate", "What can be nominal interest rate", "what do you mean by nominal interest rate"], "responses": ["The nominal interest rate is the interest rate on a loan or on savings deposits unadjusted for the rate of inflation.", "In short, it is the sum of real interest rate and inflation"]}, {"tag": "real interest rate", "patterns": ["what is mean by real interest rate?", "do you know real interst rate?", "what is real interest rate", "Tell me about real interest rate", "real interest rate", "what can be real interest rate?", "What do you mean by real interest rate"], "responses": ["A real interest rate is an interest rate that has been adjusted to remove the effects of inflation to reflect the real cost of funds to the borrower and the real yield to the lender or to an investor.", "The real interest rate reflects the rate of time-preference for current goods over future goods."]}, {"tag": "narrow money", "patterns": ["what is mean by narrow money?", "do you know narrow money in financial markets?", "what is narrow money", "Tell me about Narrow money", "Narrow money", "what can be Narrow money", "What do you mean by Narrow money"], "responses": ["Narrow money refers to a category of money supply that includes all the real money held by the central bank. It includes coins and currency, demand deposits, and other liquid assets.", "The narrow money definition of the money supply is a measure of the value coins and notes in circulation and other money equivalents that are easily convertible into cash such as short term deposits in the banking system."]}, {"tag": "passporting", "patterns": ["what is mean by pass porting?", "do you know passporting?", "what is passporting", "Tell me about passporting", "passporting", "What can be passporting", "what do you mean by passporting"], "responses": ["Passporting allows a firm registered in the European Economic Area (EEA) to do business in any other EEA state without the need for further authorization from each country.", "EU legislation gives UK banks, insurers and investment firms ‘passporting’ rights to provide a range of financial services to clients across the EU – either cross-border or through local branches – while remaining regulated solely by their ‘home’ state."]}, {"tag": "PRA", "patterns": ["what is mean by Prudential Regulation Authority or PRA?", "do you know PRA?", "what is PRA", "PRA", "what can be PRA"], "responses": ["The PRA is part of the Bank of England and is responsible for the prudential regulation and supervision of around 1,700 banks, building societies, credit unions, insurers and major investment firms.", "The PRA has a particular focus on the solvency of specific financial markets such as: Insurance providers, Buy-to-let mortgage lenders, Credit unions and other specialist lenders."]}, {"tag": "Ring Fence", "patterns": ["what is mean by ring-fence?", "do you know ring fence?", "Ring fencing?", "what is ring fence", "Tell me about ring fence", "Ring Fence"], "responses": ["A ring-fence is a virtual barrier that segregates a portion of an individual's or company's financial assets from the rest.", "Ringfencing is when a regulated public utility business financially separates itself from a parent company that engages in non-regulated business."]}, {"tag": "VAR", "patterns": ["what is mean by Value at risk?", "do you know VAR?", "what is exactly VAR?", "what is VAR", "Tell me about VAR", "Do you know Value at Risk", "VAR", "Value at Risk"], "responses": ["Value at risk is a measure of the maximum loss expected on an investment.", "For example, a 2% value at risk of a £3 million investment means that there is a 2% chance that a portfolio will lose £3 million in a given year."]}, {"tag": "Compound interest", "patterns": ["What is mean by Compound interest", "Compound interest", "what is compound interest", "Tell me about compound interest", "Do you know compound interest?", "What can be compound interest", "What do you mean by compound interest"], "responses": ["It is the interest on the amount of money you have deposited or borrowed", "When you are investing or saving, compound interest is charged on the original amount you have accumulated over time"]}, {"tag": "FICO score", "patterns": ["What is Fico Score", "What is mean by Fico Score", "Fico Score means?", "Fico score", "Do you know Fico Score", "Tell me about Fico Score", "What can be Fico score"], "responses": ["Your Fico score is based on several factors including payment history, the length of your credit history and total amount owed", "Fico Score Reanges from 300 to 850, and the higher the score,the better the terms you may receive on your next loan or credit card.", "People with Fico scores below 620 may have a harder time securing credit at a favourable interest rate"]}, {"tag": "Net Worth", "patterns": ["What is Net Worth", "What is mean by Net Worth", "net worth means?", "Net worth", "Do you know Net Worth", "Tell me about Net worth", "What does Net worth do?", "What do you mean by Net worth", "what can be networth"], "responses": ["Your networth is simply the difference between your assets"]}, {"tag": "Asset allocation", "patterns": ["What is Asset allocation", "What is mean by Asset allocation", "Asset allocation means?", "Asset allocation", "Do you know Asset allocation", "Tell me about Asset allocation", "What does Asset allocation do?", "What `do you mean by Asset allocation", "what can be Asset allocation"], "responses": ["Asset allocation is where you choose to put your money", "The three major asset classes are stocks, bonds, and cash"]}, {"tag": "Term life insurance", "patterns": ["What is term life insurance", "Do you know term life insurance", "what is mean by term life insurance", "Tell me about term life insurance"], "responses": ["Term life insurance provide coverage over a set period, generally anywhere from five to 30 years", "If you die within the set term, your beneficiaries receive a payout. If you don't,the policy expires with no value."]}, {"tag": "Thank you", "patterns": ["Thank you", "Thank you so much for your help"], "responses": ["Its my pleasure.", "You are welcome", "No problem. Its my pleasure to help you"]}]}